Revit 2017 API
PlanViewRange Class
 This class represents the view range of a plan view or a plan region. It records the element ids of the levels which a plane is relative to and the offset of each plane from that level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public class PlanViewRange : IDisposable
Visual Basic
Public Class PlanViewRange _
	Implements IDisposable
Visual C++
public ref class PlanViewRange : IDisposable
Examples
CopyC#
private void ViewRange(Document doc, View view)
{
    if (view is ViewPlan)
    {
        ViewPlan viewPlan = view as ViewPlan;
        PlanViewRange viewRange = viewPlan.GetViewRange();
        ElementId topClipPlane = viewRange.GetLevelId(PlanViewPlane.TopClipPlane);
        double dOffset = viewRange.GetOffset(PlanViewPlane.TopClipPlane);
        if (topClipPlane.IntegerValue > 0)
        {
            Element levelAbove = doc.GetElement(topClipPlane);
            TaskDialog.Show(view.Name, "Top Clip Plane: " + levelAbove.Name + "\r\nTop Offset: " + dOffset + " ft");
        }
    }
}
CopyVB.NET
Private Sub ViewRange(doc As Document, view As View)
   If TypeOf view Is ViewPlan Then
      Dim viewPlan As ViewPlan = TryCast(view, ViewPlan)
      Dim viewRange__1 As PlanViewRange = viewPlan.GetViewRange()
      Dim topClipPlane As ElementId = viewRange__1.GetLevelId(PlanViewPlane.TopClipPlane)
      Dim dOffset As Double = viewRange__1.GetOffset(PlanViewPlane.TopClipPlane)
      If topClipPlane.IntegerValue > 0 Then
         Dim levelAbove As Element = doc.GetElement(topClipPlane)
         TaskDialog.Show(view.Name, "Top Clip Plane: " + levelAbove.Name & vbCr & vbLf & "Top Offset: " & dOffset & " ft")
      End If
   End If
End Sub
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PlanViewRange
See Also
PlanViewRange Members
Autodesk.Revit.DB Namespace